{
  "publishedAt": "2024-06-16T20:04:18.277Z",
  "title": "Updated ArisaKnits Apple Watch Row Counter (2.0) and made a free web version",
  "body": "## ArisaKnits Row Counter Apple Watch App \n\nI﻿'m excited to share that the 2.0 update for the [ArisaKnits Row Counter Apple Watch app ](https://www.arisaknits.com/rowcounter/watchos)is live! It went live a few weeks ago now and I had been working on it on and off for a couple months.\n\nThis update was the first time I wrote the code all by myself with minimal help. I'm so proud of this accomplishment in my programming journey. There were many moments were I got stuck and got impatient on how slow my progress was going, but I pushed through and got this update out!\n\n## M﻿ore info on update 2.0\n\n* New reset row setting! Set the row to automatically reset the counter when reaching that specific row (helpful for when following a repeating pattern)\n* New counter linked to the reset row setting that tracks the number of repeats\n* Update the counter face where the main counter is now the increase button making the button bigger than the decrease button\n* Reset Counter button is now set as destructive and bright red\n\n**T﻿ip: Apple Watches by default will close the app after 2 minutes. You can change this setting to 1 hour by going to Settings > General > scroll down to \"Return to Clock\" > select \"After 1 hour\"**\n\n\n\n![Screenshot of the Settings face on the Apple Watch app ArisaKnits Row Counter ](/img/v2.0screenshot_settings.png \"ArisaKnits Row Counter Apple Watch app - Settings face\")\n\n![Screenshot of the Row Counter face on the Apple Watch app ArisaKnits Row Counter ](/img/v2.0screenshot_counter_w_repeat.png \"ArisaKnits Row Counter Apple Watch app - Row Counter face\")\n\n## A﻿risaKnits Row Counter Web App\n\nS﻿ince the last time I blogged, I also made a[ web version of the row counter](https://www.arisaknits.com/rowcounter/web) and released it earlier this year (whaaat!). I learned so much while working on this web version. It helped pushed my programming k﻿nowledge past a big hurdle that I struggled t﻿o get past for many many years. My coach, [Nicole Cruz](https://nicolecruzcoaching.com/), and the coaching cohort I joined last year helped me get past the internal struggle, build my confidence and trust in myself. T﻿hose tools that I learned allowed me to learn something new like coding. I also had so much support and guidance from my husband while I was work on the web app -- helping me understand what I didn't know and helping me Google :)\n\n## Plans for next update\n\nI﻿'m working on the ability to add multiple counters! I'm starting with updating the [web version](https://www.arisaknits.com/rowcounter/web) of it to make it easier for my friends to help test and then I'll add the update over to my Apple Watch app once it's done!\n\n![Screenshot of my work-in-progress ability to create multiple counters on the web version of the ArisaKnits Row Counter](/img/image-6-16-24-at-9.33 pm.jpeg \"ArisaKnits Row Counter web app - work-in-progress new counter button \")\n\n## C﻿urrent Work In Progress\n\nI﻿ started my second ever weaving project on my Ashford Knitters Loom (rigid heddle loom)! I'm hoping to make  a pillow cover with it. We shall see what happens haha. \n\n![Photo of my current weaving project in dark gray and bright green stripes](/img/img_4589.jpeg \"Photo of my current weaving project in dark gray and bright green stripes\")\n\nI﻿'m also working on my second pair of The Whimsical Sock Collective - Sock 2. I've been wanting to make these socks and it'll be a great pair for the fall.\n\n![Working on a pair of dark green socks ](/img/img_4600.jpeg \"The Whimsical Sock Collective - Sock 2 work in progress\")",
  "description": "I've made so much progress learning to program in the past year while working on my row counter app!"
}