{
  "publishedAt": "2022-02-01T05:33:47.533Z",
  "title": "Finally a fun project to learn how to program! ",
  "description": "Learning Tailwind CSS, NuxtJS, and SwiftUI with my website and app.",
  "body": "Every year I attempt to learn how to code by trying out a course with my husband, watching some video, or trying out some new how to code app. Up until now, I've struggled to stay motivated and not get overwhelmed by all the information getting thrown at me. Working on this row counter app for the Apple Watch is the first time I've felt so excited about a project!\n\nThanks to Burton, he's helped me set up the app and is the one that made this website for me. I've been able to make small edits to the app and website and feel a small sense of victory each time. It's exciting each time I find the documentation, understand what I'm even reading, and apply that to our code. I really hope I keep this momentum!\n\n## ArisaKnits Website\n\nI've added two new pages to my website: the Row Counter App product page and the privacy policy page! I enjoyed learning [TailwindCSS](tailwindcss.com) and how to make sure my website is mobile-friendly. I'm also currently working on the localization of my website to include Thai! It was a fun way to understand how to localize a website using [NuxtJS](https://i18n.nuxtjs.org/)!\n\n## ArisaKnits Row Counter App\n\nBurton and I have been talking about making a Row Counter app that I can use for knitting for a while now. I have some apps that I use, but there are many frustrations with the UI and especially with the watch experience. So, I thought it'd be fun to make an app that I actually enjoy using and can track all of the charts and the increase/decrease rows in a pattern.\n\nBurton spent a day getting row counter app on watchOS. What took forever to get the app set up on Apple's \"App Store Connect\" was just getting all the information filled out for the app, my account, learning how to upload the build from Xcode to App Store Connect, and creating the product and privacy policy pages on my website. It was very frustrating and I'm glad I don't have to go through that again.\n\nThe app is pretty barebones right now with only a way to increase or decrease the number of rows.\n\n![Apple Watch screen of version 1 ArisaKnits Row Counter app with a minus and plus button to increase or decrease the number of rows ](/img/img_9823.jpeg \"V1 Apple Watch screen of ArisaKnits Row Counter app\")\n\nI have so many ideas on version 2 of this app. It's difficult figuring out what features to include and how to fit it in the Apple Watch screen without it being so cluttered. I designed these screens on Figma-- I'm sure I'll be making lots of changes to it.\n\n![V2 ArisaKnits Row Counter app designed to include new features such as multiple projects, two counters, and repeating.](/img/screen-shot-2022-01-31-at-9.50.37-pm.png \"V2 ArisaKnits Row Counter app designed to include new features such as multiple projects, two counters, and repeating\")\n\nWhat apps or tools do you use to track your rows while knitting? What tools did you wish you had?\n\n## Latest Work in Progress\n\nI'm working on the pattern Ito Yuu by Eri Shimizu. It's a cute sweater using Isager Silk Mohair and Farmers Daughter Squish Fingering in Desert Rose. I love the cable pattern and the color I chose for it. Mohair is so soft.\n\n![Work in progress sweater on needles with yellow mohair and pink wool fingering weight ](/img/img_9805.jpeg \"Sweater status\")\n\n![Close up photo of the knit with yellow mohair and pink wool fingering yarn.](/img/img_9804.jpeg \"Close up photo of WIP sweater\")\n\nA note: I've been using [Obisidian](https://obsidian.md/) to track all the yarn, gauge, and needle sizes for each project. It takes some time to get used to because there's so much you can customize, but once you get the hang of it, it's amazing. I highly recommend it!\n\n![Screenshot of my Obsidian notes tracking my yarn and pattern info](/img/screen-shot-2022-01-31-at-10.41.39-pm.png \"Screenshot of my notes on Obsidian\")"
}
