{
  "publishedAt": "2020-12-17T02:43:26.703Z",
  "body": "I gave up on crocheting 4 years ago and switched to knitting after struggling to understand patterns and not have any experts to help! It seemed like everyone at the yarn store knitted.\n\nEverything I crochet was too big, as you can see with this hideous hat I made at that time:\n\n![Oversized blue/purple-ish crochet hat](/img/img_5917.jpg \"Oversized crochet hat\")\n\nAnd a closer look at how big the hat was:\n\n![A picture of the start of my crochet at](/img/img_1537.jpg \"Crochet progress\")\n\nBut after 6 tries of figuring out how to crochet in the round this week (is that what it's called?), I was able to create this cute little head! It took me a bit to figure out where I was supposed to crochet into and where the round end and starts. I solved that by putting a stitch marker on the start of the round-- I guess my knitting skills helped me figure out how to crochet!\n\n![A complete rounded head of the amigurumi fox with eyes attached but no ears](/img/IMG_6753.jpeg \"Amigurumi head\")\n\nI got the pattern for this crochet kit I got from an old coworker a few years ago. And I'm finally trying to make something from it! It's all feeling very straightforward  now :)\n\n![Woodland crochet book I'm using to crochet the amigurumi fox](/img/IMG_6754.jpeg \"Woodland Crochet book\")\n\n\n\nI highly recommend the book [Stitch 'n Bitch Crochet: The Happy Hooker](https://bookshop.org/books/stitch-n-bitch-crochet-the-happy-hooker/9780761139850) for those that want to learn to crochet. It's been beneficial to reference the illustrations in there that make it difficult to see in a video, like which stitches you count and where to crochet a new stitch. Her book [Stitch 'n Bitch: The Knitter's Handbook](https://bookshop.org/books/stitch-n-bitch-the-knitter-s-handbook/9780761128182) was also very helpful when I was just learning how to knit.",
  "title": "First time working on an amigurumi",
  "description": "Attempting to crochet an amigurumi fox after not crocheting for 4 years!"
}
