{
  "publishedAt": "2024-08-16T20:33:53.055Z",
  "title": "Flock Fiber Festival 2024",
  "description": "Flock and the panels I went to on Crochet Inclusivity and Importance of LYS",
  "body": "*Flock is a two-day festival for fiber artists – from crocheters to spinners and weaving that started only last year. This year, they expanded the festival to two days of marketplace and three days of classes!*\n\nFlock was such a blast!\n\nI’ve been to many conventions in the past 20 years (wow, am I that old now?) – video games, comics, and anime conventions and this was my very first convention for fiber artists. I’ve seen so many conventions I’ve been going to for a while now grow into something so big that they start becoming soulless and even more filled with advertisements from big companies. I loved how small and intimate the community at Flock is. With how small it is, you can directly interact and get to know the makers of the yarn, patterns, etc. There’s an importance around community and quality of their products over the greed of wanting more money. For those of you con-goers, it’s like the whole festival is an Artist Alley.\n\n![Arisa with some yarn friends at Flock](/img/img_5541.jpeg \"Arisa with some yarn friends at Flock\")\n\nI didn’t get to sign up for the classes in time as they sold out very quickly, but I did get to enjoy the panels/talks that were there. I’ll summarize the two panels I went to below!\n\n## Crochet Inclusivity\n\nWith [Britt of Makers of Color Collective](https://www.knotbadbritt.com/), [Toni of TL Yarn Crafts](https://tlyarncrafts.com/),[ Lori of Aklori Designs](https://www.akloridesigns.com/), [Becka of Radiant Bean](https://radiantbeans.com/) \n\nThis panel covered the need for inclusivity around crocheting. Despite how much more popular crocheting is compared to knitting in the rest of the world, the local yarn stores in the US tend to only have knitting classes, knitting samples, and limited knowledge on crocheting in general.\n\nI resonated with this a lot because I started out crocheting first almost ten years ago. I didn’t know anyone that knew how and the local yarn stores weren’t able to help me either so I switched to knitting instead because it was more accessible for me. \n\n## The Importance of our LYS and our Online Communities\n\n[Candice of The Farmer's Daughter Fibers](https://thefarmersdaughterfibers.com/), [Jess of La Mercerie](https://shoplamercerie.com/), [Melissa of Starlight Knitting Society](https://www.starlightknittingsociety.com/), [Sunni of Yarn](https://www.yarn-fun.com/), [Jen of Making Co.](https://makingzine.com/)\n\nThe discussion was on the importance of local yarn stores and online communities for people. There were many beautiful stories shared around seeing how much their yarn stores had positively impacted someone’s life – being the only place they could be who they are or the only place they found joy in. I wish I remembered who said this because it’s my favorite quote from the panel: “the third place is a place where people can be who they are without responsibilities of life and work.” I’m a huge fan of the third place concept but I never thought about why people might need a third place to step away from their daily life and work.\n\nI also agree with what (I think it was) Candice said: “the more that tech grows, the more we will want in person interactions.” I’ve seen people move away from video games to more board games because of this. I also notice this in myself now that I work remotely from home and have joined all these wonderful communities online, but find myself also needing in-person communities too.\n\nAnyway, such great discussions and I’m looking forward to thinking about these topics more.\n\n## What I’m making:\n\n(I only have crochet projects that I’m working on right now with my very first clothing wear!)\n\nAnother Rodney  from amigurumi [Thank Goodness You’re Here](https://thankgoodness.game/) – a game we (Panic) just released\n\nCrocheting mini hexagons (I don't have a photo but I'll share more in a couple weeks!)\n\nStarting [Britt’s new Shore Pine Cowl ](https://www.knotbadbritt.com/patterns/p/shore-pine-cowl)for my trips to Europe later this year!\n\n![Crocheted Rodney from Thank Goodness You're Here ](/img/img_4556.jpeg \"Crocheted Rodney from Thank Goodness You're Here\")\n\n![Crocheted piece of the Shore Pine Cowl in a yellow bulky weight wool](/img/img_5594.jpeg \"Crocheted piece of the Shore Pine Cowl in a yellow bulky weight wool\")"
}