{
  "publishedAt": "2020-11-10T05:08:50.375Z",
  "title": "Knitting swatches and storing them",
  "description": "I'm now a huge swatch knitter! How does everyone store their swatches?",
  "body": "Sooo, time flies, and it's now been over a month since I've posted my first intro post.\n\nI'm sure this is what many new bloggers go through of being indecisive of what to write about and then never writing. My goal with this first post after the introductory post was to write about something knitting-related. I mean, my website is called ArisaKnits, after all. \n\nAnyway, I finally have a knitting-related thing to talk about. \n\n## Swatches\n\nEver since I took a sweater knitting workshop 2 years ago, I've been knitting swatches for all of my projects. I don't wash my swatches, though.\n\n**Does washing your swatch make much of a difference to the gauge?** (I'm curious what others think about that).\n\nWell, I now have so many swatches for all the projects I've worked on, and I can't bring myself to trash them. I feel like I'll need it eventually, but I don't really have a great way of organizing them, and I have forgotten all the details about the yarn now.\n\n**How does everyone store their extra yarn, swatches, etc.?**\n\n![Variety of yarn colors and knitted swatches](/img/img_6522.jpg \"Gauge swatch\")\n\nAlso, the needle size that I end up using for the project never seems to match the needle the pattern suggests! I guess my gauge is just bigger than the average. I wonder how many people actually knit with the exact same gauge as the pattern.\n\n## Latest finished knitted object\n\nBelow are the latest socks that I knitted for my cousin. It's the second time I've used this pattern (Ode To Barbara by [@summer.lee.knits](https://www.instagram.com/summer.lee.knits/)), and I'm planning to make a pair for myself since I have a huge stash of La Bien Aimée's Super Sock yarn! \n\nI'm trying hard to get through my yarn stash without buying new yarn, so **if you have any recommendations on patterns for La Bien Aimée's Super Sock yarn, DM me at [@arisaknits](https://www.instagram.com/arisaknits/)!**\n\n![Purple, gray, and white speckled socks with the cuffs, toes, and heel in gray](/img/83cfc6f3-d082-4c60-9a7f-5bdc32f38ab3_1_105_c.jpeg \"Purple, gray, and white speckled socks\")\n\nAlright, that's all I had. See you all next week! And, thanks for reading."
}
