{
  "publishedAt": "2021-01-02T21:09:47.867Z",
  "body": "I've been taking private Thai language classes on [Italki](https://www.italki.com/i/FCBfbA?hl=en). It's been such a great experience really learning new words and relearning things within variety of topics such as politics, COVID, science, etc. \n\n\n\nRecently, a family member of mine was diagnosed with a Tic Disorder. So, in one of my classes, we had gone through the Tourette Association of America website to translate the CBIT overview page with the goal of helping my family better understand what a Tic Disorder is and what CBIT can do to help.\n\n\n\nI've definitely gotten a lot better at this stuff and had to help interpret some of the things the therapist of saying to my aunt. I don't think I would have been able to do that a year ago!\n\n\n\nReference: <https://tourette.org/research-medical/cbit-overview/>\n\n> CBIT เป็นการรักษาแบบไม่ต้องพึ่งยา ประกอบด้วยสามส่วน:\n>\n> 1. ฝึกคนไข้ให้สามารถรู้สึกระวังอาการของตัวเอง และอาการเตือนก่อนที่จะกระตุก\n> 2. ฝึกคนไข้ที่จะแข่งขันกับพฤติกรรมของตัวเองที่เกิดขึ้น\n> 3. ช่วยปรับพฤติกรรมสำหรับกิจกรรมในแต่ละวันเพื่อให้มีการกระตุกน้อยลง\n>\n>\n>\n> วิธีการเล่านี้เป็นวิธีที่หลายคนใช้ในการจัดการอาการ โรคติกส์ หรือ โรคกล้ามเนื้อกระตุกโดยที่ไม่ตั้งใจ (Tic Disorder) ผู้ใหญ่บางคนที่มี โรคติกส์ หรือ อาการทูเร็ตต์ (โรคติกส์ประเภทหนึ่ง) ได้บันทึกว่าใช้วิธีจัดการอาการโรคติกส์คล้ายกับวิธีการจัดการของ CBIT\n>\n>  \n>\n> CBIT เป็นแนวคิดของการที่จะใช้กลยุทธ์ร่วมกับการช่วยเหลือในการเรียนรู้เทคนิคอย่างรวดเร็ว คนที่มีโรคติกส์จะไม่สามารถมีวิธีหลีกเลี้ยงอาการกระตุกได้แต่ CBIT จะสามารถช่วยค่วบคุมอาการได้ \n>\n>\n>\n> อาการกระตุกนี้เกี่ยวข้องกับสมอง แต่จะเกิดขึ้นบ่อยขึ้นเมื่อเจอกับสถานการที่ไปกระตุ้นให้ง่ายขึ้น \n>\n>  \n>\n> CBIT \n>\n>  \n>\n> * จะพยายามช่วยให้คุ้นเคยกับตัวเองและบอกได้ว่าปัจจัยสถานการและสิ่งแวดล้อมที่จะทำให้การกระตุกแย่ลง\n> * จะช่วยสอนทักษะในการสร้างสิ่งแวดล้อมที่ทำให้รู้สึกมั่งคง คาดเดา และจัดการการกระตุกได้ง่ายขึ้น\n>\n>  \n>\n> เขาได้มีการศึกษาเกี่ยวกับ CBIT ที่พบว่า มากกว่าครึ่งคนที่ใช้ CBIT จะมีอาการกระตุกน้อยลง วิธีการหยุดการกระตุก หรืออาการต่างๆ ที่เกี่ยวข้องกับโรคติกส์เกิดได้แค่บางครั้ง CBIT นี้ไม่ใช่วิธีการรักษาโรคติกส์ แต่เป็นการบำบัด \n>\n> เป็นเครื่องมือที่ช่วยให้สามารถจัดการการกระตุกได้ดีขึ้น และมีคุณภาพที่ดีขึ้น\n>\n>  \n>\n> การศึกษาล่าสุดพบว่า 87% ที่ได้ทำการบำบัด  CBIT รู้สึกดีขึ้นหกเดือนหลังจากได้ทำการบำบัด",
  "title": "Thai Translation: CBIT Overview / แปลไทย ภาพรวม CBIT",
  "description": "With the help of my Thai teacher, I was able to translate CBIT overview from the Tourette Association of America website"
}
